---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillDifferentPhase
source: html/7df3db53-ead3-daca-4174-602548754230.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InfillDifferentPhase Property

Wall and instance have different phasing settings. Automatic creation of the infilling wall fails.

## Syntax (C#)
```csharp
public static FailureDefinitionId InfillDifferentPhase { get; }
```